zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/startup_MCXW236.cpp
WEAK void CTIMER3_IRQHandler(void)
{
    CTIMER3_DriverIRQHandler();
}

WEAK void FLEXCOMM0_IRQHandler(void)
{
    FLEXCOMM0_DriverIRQHandler();
}

WEAK void FLEXCOMM1_IRQHandler(void)
{
    FLEXCOMM1_DriverIRQHandler();
}

WEAK void FLEXCOMM2_IRQHandler(void)
{
    FLEXCOMM2_DriverIRQHandler();
}

WEAK void Reserved33_IRQHandler(void)
{
    Reserved33_DriverIRQHandler();
}

WEAK void Reserved34_IRQHandler(void)
{
    Reserved34_DriverIRQHandler();
}

WEAK void Reserved35_IRQHandler(void)
{
    Reserved35_DriverIRQHandler();
}

WEAK void Reserved36_IRQHandler(void)
{
    Reserved36_DriverIRQHandler();
}

WEAK void Reserved37_IRQHandler(void)
{
    Reserved37_DriverIRQHandler();
}

WEAK void BLE_LL_IRQHandler(void)
{
    BLE_LL_DriverIRQHandler();
}

WEAK void BLE_SLP_TMR_IRQHandler(void)
{
    BLE_SLP_TMR_DriverIRQHandler();
}

WEAK void WDT_IRQHandler(void)
{
    WDT_DriverIRQHandler();
}

WEAK void Reserved41_IRQHandler(void)
{
    Reserved41_DriverIRQHandler();
}

WEAK void Reserved42_IRQHandler(void)
{
    Reserved42_DriverIRQHandler();
}

WEAK void BOD1_IRQHandler(void)
{
    BOD1_DriverIRQHandler();
}

WEAK void BOD2_IRQHandler(void)
{
    BOD2_DriverIRQHandler();
}

WEAK void RTC_IRQHandler(void)
{
    RTC_DriverIRQHandler();
}

WEAK void Reserved46_IRQHandler(void)
{
    Reserved46_DriverIRQHandler();
}

WEAK void WAKE_DSLP_IRQHandler(void)
{
    WAKE_DSLP_DriverIRQHandler();
}

WEAK void PIN_INT4_IRQHandler(void)
{
    PIN_INT4_DriverIRQHandler();
}

WEAK void PIN_INT5_IRQHandler(void)
{
    PIN_INT5_DriverIRQHandler();
}

WEAK void PIN_INT6_IRQHandler(void)
{
    PIN_INT6_DriverIRQHandler();
}

WEAK void PIN_INT7_IRQHandler(void)
{
    PIN_INT7_DriverIRQHandler();
}

WEAK void CTIMER2_IRQHandler(void)
{
    CTIMER2_DriverIRQHandler();
}

WEAK void CTIMER4_IRQHandler(void)
{
    CTIMER4_DriverIRQHandler();
}

WEAK void OS_EVENT_IRQHandler(void)
{
    OS_EVENT_DriverIRQHandler();
}

WEAK void SPIFI_IRQHandler(void)
{
    SPIFI_DriverIRQHandler();
}

WEAK void Reserved56_IRQHandler(void)
{
    Reserved56_DriverIRQHandler();
}

WEAK void Reserved57_IRQHandler(void)
{
    Reserved57_DriverIRQHandler();
}

WEAK void Reserved58_IRQHandler(void)
{
    Reserved58_DriverIRQHandler();
}

WEAK void FLASH_CCIF_IRQHandler(void)
{
    FLASH_CCIF_DriverIRQHandler();
}

WEAK void FLASH_DFIF_IRQHandler(void)
{
    FLASH_DFIF_DriverIRQHandler();
}

WEAK void Reserved61_IRQHandler(void)
{
    Reserved61_DriverIRQHandler();
}

WEAK void Reserved62_IRQHandler(void)
{
    Reserved62_DriverIRQHandler();
}

WEAK void Reserved63_IRQHandler(void)
{
    Reserved63_DriverIRQHandler();
}

WEAK void Reserved64_IRQHandler(void)
{
    Reserved64_DriverIRQHandler();
}

WEAK void SEC_HYPERVISOR_CALL_IRQHandler(void)
{
    SEC_HYPERVISOR_CALL_DriverIRQHandler();
}

WEAK void SEC_GPIO_INT0_IRQ0_IRQHandler(void)
{
    SEC_GPIO_INT0_IRQ0_DriverIRQHandler();
}

WEAK void SEC_GPIO_INT0_IRQ1_IRQHandler(void)
{
    SEC_GPIO_INT0_IRQ1_DriverIRQHandler();
}

WEAK void PLU_IRQHandler(void)
{
    PLU_DriverIRQHandler();
}

WEAK void SEC_VIO_IRQHandler(void)
{
    SEC_VIO_DriverIRQHandler();
}

WEAK void HASHCRYPT_IRQHandler(void)
{
    HASHCRYPT_DriverIRQHandler();
}

WEAK void CASPER_IRQHandler(void)
{
    CASPER_DriverIRQHandler();
}

WEAK void PUF_IRQHandler(void)
{
    PUF_DriverIRQHandler();
}

WEAK void TRNG_IRQHandler(void)
{
    TRNG_DriverIRQHandler();
}

WEAK void DMA1_IRQHandler(void)
{
    DMA1_DriverIRQHandler();
}

WEAK void Reserved75_IRQHandler(void)
{
    Reserved75_DriverIRQHandler();
}

WEAK void CDOG_IRQHandler(void)
{
    CDOG_DriverIRQHandler();
}

//*****************************************************************************

#if defined(DEBUG)
#if defined(__GNUC__)
#pragma GCC pop_options
#endif //(__GNUC__)
#endif //(DEBUG)
